{"props":{"pageProps":{"date":"2023-08-23","stories":[{"id":229248,"url":"https://archive.ph/rOt4c?utm_source=tldrcrypto","title":"Binance, the Biggest Player in Crypto, Is Facing Legal Risks Over Russia (7 minute read)","tldr":"Binance is being investigated by the DOJ over potential US sanctions violations concerning Russia. Despite scaling back operations in Russia following the Ukraine invasion and implementing Western sanctions requirements, substantial ruble trading has continued on Binance's platform. The exchange is suspected of helping clients convert funds from sanctioned Russian banks into Binance balances and enabling trades involving blacklisted banks. This is just another of many accusations that US regulators have made and are investigating Binance over.","date":"2023-08-23","category":"markets","newsletter":"crypto"},{"id":229252,"url":"https://twitter.com/0xCygaar/status/1693705049359385060?utm_source=tldrcrypto","title":"Breaking Down Friend.Tech’s Stack (4 minute read)","tldr":"This thread looks into Friend.tech’s stack to understand it better and to find any potential vulnerabilities. It points out that the app has a lack of bot protection, which could potentially allow for DDoS attacks and information sniping. The wallets on the platform are not very secure. They are generated by Friend.tech and you can export the keys if you would like to connect to your wallet outside of the app. However, this means that Friend.tech has your private keys, making them vulnerable to a platform hack.","date":"2023-08-23","category":"guides","newsletter":"crypto"},{"id":229249,"url":"https://www.coindesk.com/business/2023/08/22/crypto-exchange-edx-market-taps-anchorage-as-custody-provider/?utm_source=tldrcrypto","title":"Crypto Exchange EDX Markets Taps Anchorage as Custody Provider (1 minute read)","tldr":"Crypto exchange platform EDX Markets is collaborating with federally chartered crypto bank Anchorage Digital for its clearinghouse's custody service, due to debut later this year. EDX, supported by prominent investors including Fidelity and Citadel, does not handle customers' assets directly, making a partnership like this necessary. The exchange currently offers four cryptocurrencies with plans to expand once regulatory clarity progresses in the US.","date":"2023-08-23","category":"markets","newsletter":"crypto"},{"id":229250,"url":"https://medium.com/elusiv-privacy/elusiv-launches-private-swaps-on-solana-a68b6a6db03c?utm_source=tldrcrypto","title":"Elusiv Launches Private Swaps on Solana (3 minute read)","tldr":"Elusiv has launched private token swaps on Solana, marking its first steps into private DeFi. Unlike typical decentralized exchanges with complete transparency, Elusiv allows users to swap assets anonymously. The swaps use temporary keys to unlink a user's public key and transaction, enhancing security and privacy. Privacy-focused protocols have had trouble gaining traction and steering clear of legal issues, so the fact that this is on an already widely used chain like Solana could help bring privacy-focused users on board.","date":"2023-08-23","category":"innovation","newsletter":"crypto"},{"id":229251,"url":"https://blockworks.co/news/risc-zero-zkevm?utm_source=tldrcrypto","title":"Risc Zero Introduces ‘Type 0’ zkEVM to Make Zero-Knowledge Tech More Accessible (2 minute read)","tldr":"Risc Zero will open-source its \"Type 0\" zkEVM, Zeth, to bring zero-knowledge infrastructure to developers. Written in Rust, the software not only mirrors the functionality of Ethereum, it can also be adopted by other networks, thus broadening application possibilities. It offers faster and more efficient transaction verification and application simultaneously thanks to its ability to divide computation tasks concurrently.","date":"2023-08-23","category":"innovation","newsletter":"crypto"},{"id":229253,"url":"https://twitter.com/WinterSoldierxz/status/1693944303910076458?utm_source=tldrcrypto","title":"Is Liquity Protocol v2 Solving the Stablecoin Trilemma through Delta Neutrality? (3 minute read)","tldr":"This thread explains Liquity’s upcoming reserve-backed stablecoin, planned to be released in 2024. The stablecoin’s release will be a shift from an over-collateralized system to a reserve-backed approach. One of the methods it will use includes a dynamic leverage principal-protected positions setup where the reserves, based on volatile assets like ETH, will be delta-neutral hedged. Through these innovations, Liquity aims to tackle the stablecoin trilemma: the simultaneous search for price stability, capital efficiency, and decentralization.","date":"2023-08-23","category":"guides","newsletter":"crypto"},{"id":229259,"url":"https://phantom.app/learn/developers/sign-in-with-solana?utm_source=tldrcrypto","title":"Sign In With Solana (3 minute read)","tldr":"Phantom has introduced a new feature called Sign in with Solana, which is essentially a one-click sign-on for crypto. Instead of having to connect your wallet to the site and then sign a transaction to prove that you are the address owner, the feature does it all in one click.","date":"2023-08-23","category":"cryptoquick","newsletter":"crypto"},{"id":229254,"url":"https://panteracapital.com/blockchain-letter/a-positive-black-swan/?utm_source=tldrcrypto","title":"A **Positive** Black Swan (30 minute read)","tldr":"Pantera’s August letter provides updates and discusses high-level narratives that were in focus during the month. The letter rehashes the Ripple ruling, explaining that it was actually a positive black swan event that could lead to more regulatory clarity. It goes on to look at specific topics such as web3 gaming and MEV. The upcoming halving has been in focus lately, so the update provides context on what the halving is and an analysis of what it could mean for the market.","date":"2023-08-23","category":"crypto","newsletter":"crypto"},{"id":229255,"url":"https://twitter.com/metaplex/status/1694025870594527433?utm_source=tldrcrypto","title":"How Solana is Enforcing Royalties for NFTs (2 minute read)","tldr":"Solana's marketplaces are finding favor with NFT creators due to their support of creator royalties. This can be attributed to the implementation of programmable NFTs, a unique NFT standard enabling various types of royalty enforcement created by Metaplex.","date":"2023-08-23","category":"crypto","newsletter":"crypto"},{"id":229256,"url":"https://twitter.com/brave/status/1694031091294687395?utm_source=tldrcrypto","title":"Brave Releases Solana NFT Token Gating for web3 Calls (1 minute read)","tldr":"You can now gate access to calls to a specific NFT and assign moderator rights based on NFT ownership on Brave’s web3 Calls feature.","date":"2023-08-23","category":"cryptoquick","newsletter":"crypto"},{"id":229257,"url":"https://arstechnica.com/information-technology/2023/08/chatgpt-boosts-crypto-botnet-with-ai-generated-tweets/?utm_source=tldrcrypto","title":"Crypto Botnet on X is Powered by ChatGPT (4 minute read)","tldr":"Researchers found a botnet on X using ChatGPT to promote cryptocurrency scams. The \"Fox8\" botnet is comprised of 1,140 accounts.","date":"2023-08-23","category":"cryptoquick","newsletter":"crypto"},{"id":229258,"url":"https://thedefiant.io/balancer-discloses-critical-vulnerability-with-usd33m-at-risk?utm_source=tldrcrypto","title":"Balancer Discloses Critical Vulnerability With $33m At Risk (1 minute read)","tldr":"Balancer's decentralized exchange revealed a vulnerability affecting 4% of its $836m TVL. No funds have been lost yet, but users were advised to withdraw from the affected pools.","date":"2023-08-23","category":"cryptoquick","newsletter":"crypto"}],"subject":"Fresh Binance FUD 4️⃣, Positive Black Swan 🦢, Private Swaps on Solana 🥷"},"__N_SSG":true},"page":"/crypto/[date]","query":{"date":"2023-08-23"},"buildId":"zp5OT1eBQ797DImZrAN9g","isFallback":false,"gsp":true,"scriptLoader":[]}