{"props":{"pageProps":{"date":"2023-09-06","stories":[{"id":231199,"url":"https://bit.ly/45YGoSf","title":"📈 Trade like a pro with Kraken (Sponsor)","tldr":"If you’re serious about trading crypto, the all-new version of \u003ca href=\"https://bit.ly/45YGoSf\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003eKraken Pro\u003c/a\u003e is definitely worth checking out. It’s powerful, beautiful, and packed with \u003ca href=\"https://bit.ly/45YGoSf\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003eadvanced trading features and analytics tools\u003c/a\u003e.\r\n\r\n\u003cp\u003eThis is Kraken's most powerful and flexible trading platform EVER — in a redesigned, fully-customizable interface.\u003c/p\u003e\r\n\r\n\u003cp\u003eSo go on. Head to Kraken and \u003ca href=\"https://bit.ly/45YGoSf\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003etrade like a pro\u003c/a\u003e.\u003c/p\u003e\r\n\r\n\u003cp\u003eNot investment advice. Crypto trading involves risk of loss. Kraken does not offer services to residents of Washington or New York.\u003c/p\u003e","date":"2023-09-06","category":"cryptosponsor","newsletter":"crypto"},{"id":231200,"url":"https://www.businesswire.com/news/home/20230905549860/en/Visa-Expands-Stablecoin-Settlement-Capabilities-to-Merchant-Acquirers?utm_source=tldrcrypto","title":"Visa Expands Stablecoin Settlement Capabilities to Merchant Acquirers (5 minute read)","tldr":"Visa is looking to modernize cross-border transactions by utilizing stablecoin settlement capabilities on Solana. The company is collaborating with merchant acquirers Worldpay and Nuvei to improve the speed of international settlements. Visa has previously tested millions of dollars in USDC movement between various partners over the Ethereum and Solana networks to settle fiat payments. This initiative offers Visa's clients an efficient, modern alternative to send and receive funds from Visa's treasury.","date":"2023-09-06","category":"markets","newsletter":"crypto"},{"id":231201,"url":"https://www.coindesk.com/business/2023/09/05/coinbase-creates-new-crypto-lending-service-geared-toward-large-investors/?utm_source=tldrcrypto","title":"Coinbase Creates New Crypto Lending Service Geared Toward Large Investors (2 minute read)","tldr":"Coinbase has launched a new crypto lending service for institutional clients in the US, according to a recent SEC filing. Through this platform, companies will be able to lend funds to Coinbase and receive collateral in excess of the amount they loaned, creating an overcollateralized lending mechanism. The plan is similar to the prime brokerage services of traditional banks but is different from the controversial Lend program that Coinbase scrapped last year due to regulatory issues.","date":"2023-09-06","category":"markets","newsletter":"crypto"},{"id":231202,"url":"https://twitter.com/FUN/status/1699080830646399025?utm_source=tldrcrypto","title":"Fun.xyz - The Easiest Way to Build Crypto Accounts (2 minute read)","tldr":"Fun.xyz is offering an easier way to create crypto accounts without compromising security or user experience. The non-custodial platform is based on ERC-4337, the standard that enables account abstraction. The platform provides developers with robust financial tools, secure authentication methods, flexible gas behavior, custom access control, seamless monetization methods, and more.","date":"2023-09-06","category":"innovation","newsletter":"crypto"},{"id":231203,"url":"https://metamask.io/news/latest/sell-cash-out-your-crypto-to-fiat/?utm_source=tldrcrypto","title":"Sell: Cash Out Your Crypto to Fiat (2 minute read)","tldr":"MetaMask, the largest crypto wallet, has introduced a new feature called Sell, allowing users to easily convert their crypto assets into fiat currencies like USD, EUR, and GBP. The new feature aims to improve convenience for users, enabling faster fiat conversions with fewer intermediaries. The Sell feature, currently available in the US, UK, and parts of Europe, aggregates vetted providers to offer real-time conversion options.","date":"2023-09-06","category":"innovation","newsletter":"crypto"},{"id":231204,"url":"https://twitter.com/sunnydece/status/1699124522757283997?utm_source=tldrcrypto","title":"Everything You Need to Know About Modular Blockchains (5 minute read)","tldr":"This thread is about modular blockchains, which separate chains into distinct, interchangeable components, and are emerging solutions to the limitations of the traditional monolithic architecture. These customizable components, or rollups, vary from general-purpose execution environments to app-specific platforms. Some of the advantages of using modular blockchains include optimized layer interactions and the ability to mix and match between different ecosystems.","date":"2023-09-06","category":"guides","newsletter":"crypto"},{"id":231205,"url":"https://twitter.com/DefiIgnas/status/1699052213287703023?utm_source=tldrcrypto","title":"Gearing Up for Another Cycle (7 minute read)","tldr":"This thread explains how most people need to go through 3 market cycles to achieve something in this space - learning, earning, and building generational wealth. The author shares insights from his experience, highlighting how he has been able to pattern match narratives after being in the space for a couple of cycles.","date":"2023-09-06","category":"guides","newsletter":"crypto"},{"id":231206,"url":"https://twitter.com/kankodu/status/1698992717089604064?utm_source=tldrcrypto","title":"The Domino Effect that Led to the $200m Euler Finance Hack (2 minute read)","tldr":"Euler, a permissionless lending protocol, was exploited in a $200m hack due to a function added to fix a bug that was previously reported. This thread walks through how implementing the function eventually led to the hack. The new function addressed an issue with token reserves, but unexpectedly opened potential for a larger-scale theft.","date":"2023-09-06","category":"crypto","newsletter":"crypto"},{"id":231207,"url":"https://computer.rip/2023-09-03-plastic-money.html?utm_source=tldrcrypto","title":"Plastic Money (25 minute read)","tldr":"Smart credit cards, with inbuilt microcontrollers enabling offline transactions and driving capabilities for cryptographic challenge-response authentication, have been in use in Europe since the 1980s. However, these technologies, which would technically allow a balance to be tracked and updated offline, have failed to take off in the US. This blog post provides some in-depth historical background on the topic and explains the state of where this technology is today.","date":"2023-09-06","category":"crypto","newsletter":"crypto"},{"id":231208,"url":"https://twitter.com/Travis_Kling/status/1699135859885236432/photo/1?utm_source=tldrcrypto","title":"Roundup of Binance’s Woes Over the Past 10 Months (2 minute read)","tldr":"Binance has been taking blow after blow from regulators and has begun to show cracks as a number of executives have jumped ship. This post gives a great summary of all that has happened.","date":"2023-09-06","category":"cryptoquick","newsletter":"crypto"},{"id":231209,"url":"https://twitter.com/stacy_muur/status/1699133944803823895?utm_source=tldrcrypto","title":"Ethereum: The Endgame Path (2 minute read)","tldr":"We have been seeing various stages of the Ethereum roadmap play out over the past few years. In case you aren’t familiar with the roadmap, you can see all the stages and a great summary of the roadmap here.","date":"2023-09-06","category":"cryptoquick","newsletter":"crypto"},{"id":231210,"url":"https://decrypt.co/154990/future-ethereum-upgrades-could-allow-full-nodes-to-run-on-mobile-phones-vitalik-buterin?utm_source=tldrcrypto","title":"Future Ethereum Upgrades Could Allow Full Nodes to Run on Mobile Phones (2 minute read)","tldr":"Vitalik Buterin recently discussed how potential upgrades could allow full nodes to run on mobile phones, which would lead to greater decentralization and scalability.","date":"2023-09-06","category":"cryptoquick","newsletter":"crypto"},{"id":231211,"url":"https://cryptoslate.com/more-than-half-of-turkey-has-turned-to-crypto-amid-rapid-currency-devaluation-kucoin-report/?utm_source=tldrcrypto","title":"More than Half of Turkey Has Turned to Crypto Amid Rapid Currency Devaluation (2 minute read)","tldr":"Over half of Turkey's adults use cryptocurrencies to combat inflation, with 52% investing, up from 40% in 2021.","date":"2023-09-06","category":"cryptoquick","newsletter":"crypto"}],"subject":"Visa Laying Crypto Rails 🛤️, MetaMask Sell Feature 💵, 3 Cycles to Win 🏆"},"__N_SSG":true},"page":"/crypto/[date]","query":{"date":"2023-09-06"},"buildId":"u7W78Zb1wYhx-4d0nXijT","isFallback":false,"gsp":true,"scriptLoader":[]}