{"props":{"pageProps":{"date":"2023-10-06","stories":[{"id":235846,"url":"https://www.coindesk.com/policy/2023/10/05/embargo-banks-must-disclose-crypto-holdings-as-regulators-rake-over-signature-collapse/?utm_source=tldrcrypto","title":"Banks Would Have to Disclose Crypto Holdings Under New BIS Plan (2 minute read)","tldr":"Financial authorities are considering new regulations that would require banks to disclose crypto holdings. This comes from the Basel Committee on Banking Supervision, which determines norms for traditional finance lenders. Its proposal follows a turbulent year in cryptocurrency markets, including the fall of crypto exchange FTX and startup-focused banks Signature and SVB.","date":"2023-10-06","category":"markets","newsletter":"crypto"},{"id":235847,"url":"https://messari.io/report/state-of-crypto-fundraising-q3-2023?utm_source=tldrcrypto","title":"State of Crypto Fundraising - Q3 2023 (7 minute read)","tldr":"Fundraising activity for crypto companies in Q3 2023 hit levels unseen since Q4 2020, with total quarterly funding clocking in at just under $2.1 billion across 297 deals. Funding trends showed a pivot to early-stage projects, indicating investors' strategy to back projects with high upside potential in the bear market. The prevalence of strategic investments suggests that harsh conditions have forced projects to seek short-term funding or look to be acquired.","date":"2023-10-06","category":"markets","newsletter":"crypto"},{"id":235848,"url":"https://ethresear.ch/t/zkuniswap-a-first-of-its-kind-zkamm/16839?utm_source=tldrcrypto","title":"zkUniswap: A First-of-Its-Kind zkAMM (9 minute read)","tldr":"zkUniswap is a novel proof-of-concept demonstrating a version of UniswapV3 with an off-chain computation of a swap. Execution involves using a zero-knowledge proof-based system to validate transactions, potentially reducing on-chain computation costs. zkUniswap minimizes 'front running' by utilizing a pool locking system to prevent state changes during swap transactions. Despite the still-high computation cost, parallelization of swaps and alternative implementations of request methods could make zkAMMs increasingly efficient.","date":"2023-10-06","category":"innovation","newsletter":"crypto"},{"id":235849,"url":"https://www.theblock.co/post/254976/volcano-energy-luxor-launch-lava-pool-el-salvadors-first-bitcoin-mining-pool?utm_source=tldrcrypto","title":"Firms Launch El Salvador’s First Bitcoin Mining Pool Tapping Geothermal Energy (2 minute read)","tldr":"Volcano Energy and Luxor Technology have initiated El Salvador's first Bitcoin mining pool, dubbed Lava Pool, that leverages the country's geothermal energy resources. Volcano Energy will mine bitcoin exclusively via this pool and contribute 23% of its net income to the El Salvador government as part of a public partnership initiative. This move seeks to integrate Bitcoin into El Salvador's energy infrastructure and boost economic growth.","date":"2023-10-06","category":"innovation","newsletter":"crypto"},{"id":235850,"url":"https://crypto.mirror.xyz/hl284jc3A2MI_QeTE39nRsTPihOigNuLKIWjiU2pFzw?utm_source=tldrcrypto","title":"A List of Open Problems in Crypto - II (13 minute read)","tldr":"This blog post discusses an array of open problems in crypto from verticals like DeFi to ZK and even AI. Topics range from DeFi issues like automated risk scoring and managing risk for lenders to Mechanism Design issues like Restaking Equilibria, privacy-information tradeoff for DEXs, and Mechanism Design for a ZK World. Other topics discussed include issues in MEV, Zero Knowledge crossovers, pitching a ZK benchmark, issues around wallet security and user experience, gas derivatives, state rent issues, decentralized sequencers, Oracle systems, and reputation systems. Innovation in these areas is vital for the evolution and growth of the space.","date":"2023-10-06","category":"guides","newsletter":"crypto"},{"id":235851,"url":"https://twitter.com/jake_pahor/status/1709584246254506174?utm_source=tldrcrypto","title":"MakerDAO Research Report (4 minute read)","tldr":"This research report explains how MakerDAO, through its protocol, facilitates crypto-backed loans, generating significant revenue regardless of market state. Despite a recent dip in TVL, it remains a top DeFi protocol, with its $MKR token crucial for governance and system recapitalization, aligning holder interests towards prudent ecosystem management.","date":"2023-10-06","category":"guides","newsletter":"crypto"},{"id":235852,"url":"https://portal.vc/urbit_primer?utm_source=tldrcrypto","title":"Urbit: Beyond Blockchains, A New Paradigm for the Internet (23 minute read)","tldr":"Urbit has created a completely new internet model from scratch. It consists of an operating system, an identity system, and a consensus network that delivers a peer-to-peer, sovereign implementation. While it is not a blockchain network (but rather a decentralized computing network), it can be a great complement to blockchains, extending their capabilities. This post provides a deep dive into how it works and why it’s a compelling model.","date":"2023-10-06","category":"crypto","newsletter":"crypto"},{"id":235853,"url":"https://twitter.com/MikeIppolito_/status/1709908635441086838?utm_source=tldrcrypto","title":"Enshrinement: The Topic Du Jour in Both Ethereum and Cosmos (3 minute read)","tldr":"Enshrinement is becoming a prominent theme within Ethereum and Cosmos as these ecosystems contemplate incorporating important features directly into their respective protocols. Issues like centralization risks and user experience enhancement are driving this change. However, trade-offs, including unpredictable user behavior and potential disincentivization for builders, pose challenges.","date":"2023-10-06","category":"crypto","newsletter":"crypto"},{"id":235854,"url":"https://decrypt.co/200328/are-developers-leaving-crypto-heres-whats-going-on?utm_source=tldrcrypto","title":"Are Developers Leaving Crypto? Here’s What’s Going On (3 minute read)","tldr":"Active open source crypto developers have nearly halved since January 2022, reaching a low since 2020, per data from Andreessen Horowitz and Electric Capital, but this may not be an accurate depiction of real activity in the space.","date":"2023-10-06","category":"cryptoquick","newsletter":"crypto"},{"id":235855,"url":"https://cointelegraph.com/news/friend-tech-sim-swap-attacks-continue-four-targeted?utm_source=tldrcrypto","title":"Friend.tech SIM-swap Scourge Continues as Scammer Nets $385K in Ether (2 minute read)","tldr":"A scammer stole $385,000 in Ether within 24 hours via SIM-swap hacks targeting Friend.tech users, highlighting security vulnerabilities and prompting calls for enhanced safety measures.","date":"2023-10-06","category":"cryptoquick","newsletter":"crypto"},{"id":235856,"url":"https://research.lido.fi/t/hasus-goose-submission-proposed-goals-for-lido-dao-to-consider/5590?utm_source=tldrcrypto","title":"Proposed Goals for Lido DAO to Consider (15 minute read)","tldr":"Hasu made a proposal for Lido’s governance DAO to lay out short and long-term goals and considerations for decentralization that should be incorporated into those goals.","date":"2023-10-06","category":"cryptoquick","newsletter":"crypto"},{"id":235857,"url":"https://techcrunch.com/2023/10/05/sbf-trial-gary-wang/?utm_source=tldrcrypto","title":"Alameda Had a $65B Line of Credit and ‘Unlimited Withdrawals’ (4 minute read)","tldr":"FTX co-founder Gary Wang revealed that Alameda had access to a $65B credit line, which allowed it to easily misuse FTX customer funds.","date":"2023-10-06","category":"cryptoquick","newsletter":"crypto"}],"subject":"Crypto Fundraising Woes 📉, Bitcoin Mining with Lava 🌋, Problems to Solve in Crypto 🧩"},"__N_SSG":true},"page":"/crypto/[date]","query":{"date":"2023-10-06"},"buildId":"_Y_XY3olqvPRDZOxYmiOc","isFallback":false,"gsp":true,"scriptLoader":[]}