{"props":{"pageProps":{"date":"2023-09-04","stories":[{"id":230898,"url":"https://simplysecure.org/designunderpressure/#methods?utm_source=tldrdesign","title":"Personas Non Grata (1 minute read)","tldr":"Every product will have not-so-ideal users, so anti-personas should be something to consider! This quick and funny guide may help you to avoid tricky situations down the road.","date":"2023-09-04","category":"designresources","newsletter":"design"},{"id":230899,"url":"https://www.uxpin.com/studio/blog/what-is-a-tooltip-in-ui-ux/?utm_source=tldrdesign","title":"What is a Tooltip? (10 minute read)","tldr":"This deep dive shows how tooltips can involve multiple aspects and design decisions. Packed with examples, the article outlines best practices and what you should consider when designing and adopting them.","date":"2023-09-04","category":"designmiscellaneous","newsletter":"design"},{"id":230900,"url":"https://medium.com/thinking-design/eleven-experience-design-lessons-from-adobe-design-summit-cefa8669500f?utm_source=tldrdesign","title":"Eleven Experience Design Lessons from Adobe Design Summit (8 minute read)","tldr":"The biennial, multi-day celebration of Adobe's internal design culture is a powerful way to spread its design ethos across the company. But now it's beyond that. Check out the lessons from those who attended the event.","date":"2023-09-04","category":"designmiscellaneous","newsletter":"design"},{"id":230901,"url":"https://www.uxmatters.com/mt/archives/2023/08/changes-over-the-last-25-years-of-ux-research.php?utm_source=tldrdesign","title":"Changes Over the Last 25 Years of UX Research (15 minute read)","tldr":"The UX research field has changed considerably since 1998. UX education expanded, usability became user experience, and job titles changed. Many businesses began to see the value of design and research. UX research now occurs earlier in the design process, and the number of UX jobs has increased significantly.","date":"2023-09-04","category":"designmiscellaneous","newsletter":"design"},{"id":230889,"url":"https://www.androidpolice.com/whatsapp-plans-big-ui-redesign-what-it-looks-like/?utm_source=tldrdesign","title":"WhatsApp Plans a Big UI Redesign, Here's What it Looks Like (2 minute read)","tldr":"WhatsApp is about to go through a considerable revamp that includes updated Material Design 3 UI elements and a more modern look and feel. There are also structural changes. New filters will allow you to see your unread, personal, and business messages.","date":"2023-09-04","category":"designnews","newsletter":"design"},{"id":230902,"url":"https://weandthecolor.com/4-design-principles-we-can-learn-from-ray-ban/180084?utm_source=tldrdesign","title":"Four Design Principles We Can Learn from Ray-Ban (3 minute read)","tldr":"Ray-Ban stayed relevant for eight decades in a very crowded space. Part of that success is related to the solid design culture that guides the company.","date":"2023-09-04","category":"designquick","newsletter":"design"},{"id":230890,"url":"https://www.getstark.co/blog/introducing-aria-headings-touchtargets-sidekick?utm_source=tldrdesign","title":"Stark Adds ARIA Notes and Touch Targets to Enhance Handoff (4 minute read)","tldr":"Designing with accessibility in mind is highly facilitated by using Stark's plugin for Figma and Sketch. The process has become even more integrated into the way developers enhance accessibility. Stark’s plugin now supports ARIA notes and touch target indications.","date":"2023-09-04","category":"designnews","newsletter":"design"},{"id":230903,"url":"https://pudding.cool/projects/clocks/songs/?utm_source=tldrdesign","title":"Time as Song Titles (Website)","tldr":"This fascinating online clock plays a song with the exact time in its title. It brings music from Spotify based on your local time.","date":"2023-09-04","category":"designquick","newsletter":"design"},{"id":230891,"url":"https://www.androidcentral.com/apps-software/google-chrome-web-store-redesign-preview?utm_source=tldrdesign","title":"An Early Google Chrome Web Store Preview Shows a 'Modern' Redesign (2 minute read)","tldr":"The Google Chrome Web Store redesign brings its aesthetic closer to the Play Store. The timeframe of its official arrival isn’t clear yet, but Google is asking users and developers for feedback.","date":"2023-09-04","category":"designnews","newsletter":"design"},{"id":230904,"url":"https://matthiasott.com/notes/pointing-fingers?utm_source=tldrdesign","title":"Pointing Fingers (2 minute read)","tldr":"A neat trick to read way faster. Just don't tell your teacher.","date":"2023-09-04","category":"designquick","newsletter":"design"},{"id":230892,"url":"https://garden.bradwoods.io/notes/design/user-driven-ui?utm_source=tldrdesign","title":"User Driven UI (7 minute read)","tldr":"When a product matures and covers more scope, complexity tends to follow. However, does it need to be this way? The advent of AI might provide the answer for evolving products without hurting the experience for new users.","date":"2023-09-04","category":"designstrategies","newsletter":"design"},{"id":230893,"url":"https://designerup.co/blog/how-to-pick-perfect-color-palettes-every-eime-no-plugins-or-color-generators/?utm_source=tldrdesign","title":"How to Pick Matching Color Palettes Every Time (7 minute read)","tldr":"You don't need plugins or color generators to create balanced color palettes. This practical guide helps you find equivalent colors in multiple hues based on the HSB color model.","date":"2023-09-04","category":"designstrategies","newsletter":"design"},{"id":230894,"url":"https://www.figma.com/blog/creating-coherence-how-spotifys-design-system-goes-beyond-platforms/?utm_source=tldrdesign","title":"Creating Coherence: How Spotify’s Design System Goes Beyond Platforms (9 minute read)","tldr":"How does Spotify build products for mobile devices, TVs, and websites that look and feel the same? The answer is Encore, its design system combined with cross-team collaboration with representatives for each platform.","date":"2023-09-04","category":"designstrategies","newsletter":"design"},{"id":230895,"url":"https://uxdesign.cc/a-manifesto-for-moving-beyond-creativity-bb4b5d3465db?utm_source=tldrdesign","title":"A Manifesto for Moving Beyond Creativity (12 minute read)","tldr":"Transitioning from a designer to a design leader requires a shift in mindset and the development of new skills and competencies. Now that designers have a seat at the table, they need to understand their role as design leaders, improve their communication with other stakeholders, contribute to building a solid team culture, and lead by example.","date":"2023-09-04","category":"designstrategies","newsletter":"design"},{"id":230896,"url":"https://sprig.com/?utm_source=tldrdesign","title":"Sprig Instantly Turns User Feedback into Insights with AI Analysis (Website)","tldr":"AI Analysis for Surveys is a new feature for Sprig that uses generative AI large language models to go through survey data intelligently. This functionality allows the platform to provide instantaneous insights.","date":"2023-09-04","category":"designresources","newsletter":"design"},{"id":230897,"url":"https://developer.chrome.com/en/blog/lighthouse-11-0/?utm_source=tldrdesign","title":"What’s New in Lighthouse 11 (2 minute read)","tldr":"Thirteen new accessibility audits have been added to Lighthouse since version 10. Manual audits are now available after the automatic audits are completed to help developers make their sites more accessible.","date":"2023-09-04","category":"designresources","newsletter":"design"}],"subject":"WhatsApp Redesign 🎨, Stark Supports ARIA Notes 🗒️, Chrome Store New Look ✨"},"__N_SSG":true},"page":"/design/[date]","query":{"date":"2023-09-04"},"buildId":"u7W78Zb1wYhx-4d0nXijT","isFallback":false,"gsp":true,"scriptLoader":[]}