{"props":{"pageProps":{"date":"2023-10-05","stories":[{"id":235676,"url":"https://www.framer.com/updates/localization?utm_source=tldrdesign","title":"Framer Announces AI-Powered Localization (1 minute read)","tldr":"Framer is rolling out new features that allow users to tailor website content to many languages and regions. Its AI-powered Localization covers text, UI controls, images, and CMS Variables. A video summarizing the new functionality is available.","date":"2023-10-05","category":"designnews","newsletter":"design"},{"id":235677,"url":"https://www.theverge.com/2023/10/3/23901717/gmail-emoji-reactions-android-ios?utm_source=tldrdesign","title":"Gmail is Getting Emoji Reactions (2 minute read)","tldr":"Google is launching emoji reactions on its Gmail service. The feature can be accessed via a new button next to Reply, Reply All, and Forward. It will first be available to Android users and come to web and iOS users over the next few months.","date":"2023-10-05","category":"designnews","newsletter":"design"},{"id":235686,"url":"https://daverupert.com/2023/10/nine-a11y-jobs-where-robots-suck/?utm_source=tldrdesign","title":"Nine Things Automated Accessibility Tests Can’t Test (4 minute read)","tldr":"Understanding where automated tests fall short is the first step for planning your efforts to truly cover accessibility. Some of the jobs that need to be handled by humans include focus states, autocomplete, tap target areas, zoomed-in interfaces, animations, and overall confusing UX.","date":"2023-10-05","category":"designmiscellaneous","newsletter":"design"},{"id":235678,"url":"https://www.theverge.com/2023/10/4/23902794/canva-magic-studio-ai-design-new-tools?utm_source=tldrdesign","title":"Canva’s new AI tools automate boring, labor-intensive design tasks (3 minute read)","tldr":"Canva, as part of its 10th-anniversary celebration, has launched Magic Studio, an AI-powered design suite aiming to make content creation more accessible for everyone. The suite includes features like Magic Switch for effortless design format transformations, Magic Media for text-to-video conversion, and various photo editing tools.","date":"2023-10-05","category":"designnews","newsletter":"design"},{"id":235679,"url":"https://uxdesign.cc/sustainable-email-design-fa9eb58610d8?utm_source=tldrdesign","title":"How to design climate-friendly emails (9 minute read)","tldr":"It costs energy to capture and store every email we send. The way to climate-friendly emails is to send less of them, optimize static assets, use AI sparingly, design emails for dark mode, use content delivery networks (CDNs), and measure the carbon footprint of each email.","date":"2023-10-05","category":"designstrategies","newsletter":"design"},{"id":235687,"url":"https://blog.uxtweak.com/what-is-design-operations/?utm_source=tldrdesign","title":"What is Design Operations? (13 minute read)","tldr":"DesignOps lives in the intersection between creativity and scalability. Design operations strategically coordinate people and processes to improve design outcomes while providing the necessary tools, techniques, and collaboration frameworks.","date":"2023-10-05","category":"designmiscellaneous","newsletter":"design"},{"id":235680,"url":"https://growth.design/case-studies/framing-effect?utm_source=tldrdesign","title":"Framing effect (3 minute read)","tldr":"How information is presented shapes people's perceptions and decisions. Most pricing psychology principles rely on the Framing Effect and its related cognitive biases — anchoring, social proof, default bias, and loss aversion. The same price in a different context can lead to different purchase behaviors.","date":"2023-10-05","category":"designstrategies","newsletter":"design"},{"id":235688,"url":"https://www.creativeboom.com/inspiration/katie-smith/?utm_source=tldrdesign","title":"Drawing Comforting Characters that Inspire Creativity (4 minute read)","tldr":"Katie Smith is a master at bringing unique and bold characters to life. In this interview, she shares her process, how to find inspiration, and why illustration is the perfect medium for communicating joy and fun.","date":"2023-10-05","category":"designquick","newsletter":"design"},{"id":235681,"url":"https://jenson.org/text/?utm_source=tldrdesign","title":"Mobile Text Editing: The Invisible Problem (19 minute read)","tldr":"Although it can be done, text editing on mobile isn't ok. The mobile user experience of manipulating text overloads the tap gesture with a wide range of actions, making it overly complicated and prone to errors. There are workarounds like text handles, magnifiers, text selectors, and popup menus, but none of them offers an equivalent desktop experience.","date":"2023-10-05","category":"designstrategies","newsletter":"design"},{"id":235689,"url":"https://designwanted.com/cosmo-electric-guitar-streamlined-essence/?utm_source=tldrdesign","title":"Built to Reveal Its Purest Form – A Guitar That Has Been Streamlined to Its Essence (3 minute read)","tldr":"Robin Stummvoll, an industrial designer and luthier, just released his newest creation, a Cosmo electric guitar with an innovative, adaptable pickup system. These magnetic pickups effortlessly attach to the guitar's steel body, giving guitar players a whole universe of sonic options as they position them how they prefer.","date":"2023-10-05","category":"designquick","newsletter":"design"},{"id":235682,"url":"https://www.figma.com/community/file/1287828769207775946?utm_source=tldrdesign","title":"Accessible UI Color Palette (Figma resource)","tldr":"Harmony offers highly consistent color shades and precise control over text and UI element contrast. Based on the OKLCH color space and the innovative APCA contrast algorithm, this Figma color palette includes equal contrast within lightness groups, mirrored contrast pairs, contrast levels for readability, and many other advanced features.","date":"2023-10-05","category":"designresources","newsletter":"design"},{"id":235683,"url":"https://chartscss.org/?utm_source=tldrdesign","title":"CSS Data Visualization Framework (Website)","tldr":"Charts CSS uses CSS utility classes to style HTML elements as charts. This open-source framework follows a semantic structure, is highly customizable, and is built for responsiveness. Several chart elements are available, like percentage columns, stacked columns, bar charts, and more.","date":"2023-10-05","category":"designresources","newsletter":"design"},{"id":235684,"url":"https://emoji.fly.dev/?utm_source=tldrdesign","title":"Open Source Emoji Generator (Website)","tldr":"EmojiGen is an AI open-source emoji generator. Type what you need and download a PNG version ready to be used as an emoji.","date":"2023-10-05","category":"designresources","newsletter":"design"},{"id":235685,"url":"https://uxmag.com/articles/10-reasons-why-ux-maturity-matters?utm_source=tldrdesign","title":"10 Reasons Why UX Maturity Matters (10 minute read)","tldr":"Higher UX maturity increases customer satisfaction. Loyalty drives higher ROI on digital products, enhances brand reputation, streamlines the decision-making process, attracts and retains talent, increases the time-to-market, improves collaboration, establishes a proactive approach to problem-solving, and future-proofs the organization.","date":"2023-10-05","category":"designmiscellaneous","newsletter":"design"},{"id":235690,"url":"https://www.viget.com/articles/building-motion-for-the-web-process-toolkit/?utm_source=tldrdesign","title":"Building Motion for the Web: Recipes for Design Success (13 minute read)","tldr":"A practical guide to building sophisticated animations for the web and overcoming three main challenges when doing so.","date":"2023-10-05","category":"designquick","newsletter":"design"}],"subject":"Framer’s AI Localization 🌐, Gmail Emoji Reactions ✉️, Canva’s AI Tools 🎨"},"__N_SSG":true},"page":"/design/[date]","query":{"date":"2023-10-05"},"buildId":"_Y_XY3olqvPRDZOxYmiOc","isFallback":false,"gsp":true,"scriptLoader":[]}