{"props":{"pageProps":{"date":"2023-10-06","stories":[{"id":235695,"url":"https://www.theverge.com/2023/10/4/23903859/x-elon-musk-headlines-links-image-twitter/?utm_source=tldrmarketing","title":"X stops showing headlines because of Elon Musk (2 minute read)","tldr":"Claiming aesthetic reasons, Elon Musk removed headlines and subheader text from links shared on X, leading to widespread criticism from users and employees.","date":"2023-10-06","category":"marketingnews","newsletter":"marketing"},{"id":235702,"url":"https://www.theverge.com/2023/10/4/23902794/canva-magic-studio-ai-design-new-tools?utm_source=tldrmarketing","title":"Canva’s new AI tools automate boring, labor-intensive design tasks (3 minute read)","tldr":"Canva has launched Magic Studio, an AI-powered suite of design tools aimed at enhancing and streamlining content creation. Magic Studio contains a series of features such as Magic Switch, which allows users to instantly transform designs into various formats, Magic Media, which generates short videos from text prompts or images, and Canva Shield, a set of safety, privacy, and security controls to prevent AI misuse and unsafe content creation.","date":"2023-10-06","category":"marketingresources","newsletter":"marketing"},{"id":235697,"url":"https://www.digitalmarketer.com/seo/the-future-of-seo/?utm_source=tldrmarketing","title":"The Future of SEO (5 minute read)","tldr":"This article walks through predictions on the future of SEO and how to benefit from these trends. The author predicts that AI will both enhance and hurt SEO, content with E-E-A-T will win the SERPs, and ‘system SEOs’ will outlast the AI rush. The overarching theme is that SEO is not dead. To continue earning search traffic, marketers should optimize an SEO system with efficient processes and focus on their target customers above all else.","date":"2023-10-06","category":"marketingnews","newsletter":"marketing"},{"id":235698,"url":"https://cxl.com/blog/how-ten-by-three-drove-sales/?utm_source=tldrmarketing","title":"How Ten by Three drove sales by using storytelling in their email marketing (4 minute read)","tldr":"Ten by Three didn’t see results from a typical Mother’s Day promotional email, so it tested a series of story-focused emails instead. This approach allowed it to tell the story of the product and connect emotionally with its audience. The email series resulted in a 2X increase in open rate and a spike in bundle sales.","date":"2023-10-06","category":"marketingstrategies","newsletter":"marketing"},{"id":235704,"url":"https://www.practicalecommerce.com/4-uses-of-googles-url-inspection-tool?utm_source=tldrmarketing","title":"4 Uses of Google’s URL Inspection Tool (2 minute read)","tldr":"The URL Inspection Tool within Google Search Console has powerful capabilities for SEO optimization. You can use this tool to identify reasons for not indexing, learn how Google discovered a page, confirm Google can render all page elements, and submit your URL for indexation. Each of these is valuable for diagnosing SEO issues.","date":"2023-10-06","category":"marketingresources","newsletter":"marketing"},{"id":235700,"url":"https://twitter.com/ecomchasedimond/status/1709984784204894448/?utm_source=tldrmarketing","title":"7 Common Mistakes in Email Marketing (2 minute read)","tldr":"This post provides tips on how to avoid or correct 7 common email marketing mistakes. Not segmenting email lists based on behavior, demographics, or purchase history or not designing emails with a mobile-first approach leads to missed engagement opportunities.","date":"2023-10-06","category":"marketingstrategies","newsletter":"marketing"},{"id":235707,"url":"https://elenaverna.substack.com/p/hey-b2b-i-bet-you-are-measuring-activation?utm_source=tldrmarketing","title":"90% of retention issues stem from incorrect activation (8 minute read)","tldr":"Activation is taking a user from signing up to establishing a habit around your core value proposition, but many B2B brands define this incorrectly. Activation is not just user engagement, nor is it account activation. This guide runs through what activation is and isn’t, as well as why it’s vital to get it right.","date":"2023-10-06","category":"marketingmiscellaneous","newsletter":"marketing"},{"id":235709,"url":"https://www.digitalnative.tech/p/the-hyper-personalization-of-everything?utm_source=tldrmarketing","title":"The Hyper-Personalization of Everything (13 minute read)","tldr":"Consumers now expect every experience to be personalized. If the 20th century was about mass consumption, the 21st century is about ‘bespoke consumption’. The rise of AI is making new degrees of customization possible. Soon, everyone will get their own personalized healthcare plan, learning path, and relationship mentor.","date":"2023-10-06","category":"marketingmiscellaneous","newsletter":"marketing"},{"id":235711,"url":"https://open.substack.com/pub/madisonandwall/p/amazon-prime-video-ads-setting-expectations?utm_source=tldrmarketing","title":"Amazon Prime Video Ads: Setting Expectations In a World of Diminishing TV Reach (3 minute read)","tldr":"This post discusses Amazon's decision to include limited ads on Prime Video. It highlights that while this move will benefit Amazon, estimates of its potential seem overly optimistic.","date":"2023-10-06","category":"marketingquick","newsletter":"marketing"},{"id":235713,"url":"https://www.linkedin.com/posts/ben-dutter_marketing-growthmarketing-measurement-activity-7114985132209438720-4Ulr?utm_source=tldrmarketing","title":"Can you answer these 5 questions about your brand? (2 minute read)","tldr":"This post challenges that most big brands can’t accurately answer these 5 questions about their own customers.","date":"2023-10-06","category":"marketingquick","newsletter":"marketing"},{"id":235714,"url":"https://www.inc.com/rebecca-deczynski/inside-taylor-swift-effect-how-small-businesses-are-keeping-up-with-swiftiess-need-to-shimmer.html/?utm_source=tldrmarketing","title":"How Small Business Are Keeping Up With the Taylor Swift Effect (3 minute read)","tldr":"Taylor Swift’s top-selling Eras Tour has led to a boom in sales for small fashion brands selling all things sequined and sparkly. This article shares how these brands are flexing new marketing opportunities to ride the Swiftmania wave.","date":"2023-10-06","category":"marketingquick","newsletter":"marketing"}],"subject":"7 common email marketing mistakes 🤕, new Canva AI tools 🎨, X strips headlines on articles 👋"},"__N_SSG":true},"page":"/marketing/[date]","query":{"date":"2023-10-06"},"buildId":"_Y_XY3olqvPRDZOxYmiOc","isFallback":false,"gsp":true,"scriptLoader":[]}