{"props":{"pageProps":{"date":"2023-10-06","stories":[{"id":235757,"url":"https://www.theverge.com/2023/10/5/23904392/apple-default-search-engine-bing-acquistion-duckduckgo-safari-private-browsing?utm_source=tldrnewsletter","title":"Details of Apple’s talks to replace Google with Bing and even DuckDuckGo revealed in unsealed court testimony (2 minute read)","tldr":"Newly unsealed court testimonies reveal that Apple held talks with Microsoft and DuckDuckGo to use their search engines across Apple devices. The company even considered buying Bing. An internal email suggests that the talks were a negotiating tactic to extract more money from Google. Microsoft was aware that it was being used for leverage.","date":"2023-10-06","category":"big","newsletter":"tech"},{"id":235758,"url":"https://finance.yahoo.com/news/exclusive-chatgpt-owner-openai-exploring-011259522.html?utm_source=tldrnewsletter","title":"Exclusive-ChatGPT-owner OpenAI is exploring making its own AI chips (3 minute read)","tldr":"OpenAI is exploring making its own artificial intelligence chips. It has evaluated a potential acquisition target for the move. The scarcity of graphics processing units is making it difficult for OpenAI to solve its chip shortage issues. It may take several years for OpenAI to develop its own chip if it decides to go ahead with the plan. Success in developing a custom chip is not guaranteed - many companies, including Meta, have been building their own processors for years with limited results.","date":"2023-10-06","category":"big","newsletter":"tech"},{"id":235759,"url":"https://news.mit.edu/2023/desalination-system-could-produce-freshwater-cheaper-0927?utm_source=tldrnewsletter","title":"Desalination system could produce freshwater that is cheaper than tap water (4 minute read)","tldr":"A team of engineers from MIT and China have designed a solar desalination system that passively turns seawater into drinking water. It circulates water in swirling eddies, which when combined with the sun's heat drives water to evaporate and leave salt behind. The resulting water vapor can be condensed and collected while the leftover salt circulates out of the device rather than accumulating and clogging the system. A small suitcase-sized system could produce up to 6 liters of drinking water per hour and last several years.","date":"2023-10-06","category":"future","newsletter":"tech"},{"id":235760,"url":"https://interestingengineering.com/innovation/new-3d-printing-approach-offers-hope-for-brain-injury-repair?utm_source=tldrnewsletter","title":"New 3D printing approach offers hope for brain injury repair (4 minute read)","tldr":"Scientists from the University of Oxford have created brain tissue using human stem cells through 3D printing. They were able to replicate the structure of the brain's cerebral cortex using the technique. The technology will provide researchers with new ways to explore the workings of the brain. It also offers hopes to individuals who have brain injuries as there is evidence that the printed tissue can integrate with live brains.","date":"2023-10-06","category":"future","newsletter":"tech"},{"id":235761,"url":"https://www.vantage.sh/blog/cloud-costs-every-programmer-should-know?utm_source=tldrnewsletter","title":"Cloud Costs Every Programmer Should Know (10 minute read)","tldr":"This article contains a list of cloud costs every programmer should know with a detailed breakdown of the costs. Knowing these numbers will help programmers make quick cost estimations for a variety of different projects. They will only need an idea of the architecture and size of the completed project to calculate a ballpark cost without needing any complex cost calculator.","date":"2023-10-06","category":"programming","newsletter":"tech"},{"id":235762,"url":"https://blog.replit.com/building-my-first-slack-bot?utm_source=tldrnewsletter","title":"I’m not a programmer, and I used AI to build my first bot (5 minute read)","tldr":"This tutorial guides users through how to build a Slack Bot that uses Google LLMs to provide daily channel summaries using Replit. Replit's AI is able to generate and explain code. It speeds up the process of development and can act as a tutor. The tutorial was written by someone with no programming experience other than some Python for basic data manipulation and scraping.","date":"2023-10-06","category":"programming","newsletter":"tech"},{"id":235763,"url":"https://techcrunch.com/2023/10/05/sbf-trial-gary-wang/?utm_source=tldrnewsletter","title":"Alameda had a $65B line of credit and ‘unlimited withdrawals’ (4 minute read)","tldr":"FTX co-founder and CTO Gary Wang took the stand recently, admitting to wire fraud, securities fraud, and commodities fraud and naming Sam Bankman-Fried, Nishad Singh, and Caroline Ellison as the individuals he committed the crimes with. Wang had pleaded guilty in December 2022 as part of a cooperation deal. This article provides a detailed look at Wang's testimony. It covers Alameda's $65 billion line of credit, how Bankman-Fried controlled the coding process, Alameda's naming process, and more.","date":"2023-10-06","category":"miscellaneous","newsletter":"tech"},{"id":235764,"url":"https://herman.bearblog.dev/how-i-stay-motivated-as-a-solo-creator/?utm_source=tldrnewsletter","title":"How I stay motivated as a solo-creator (4 minute read)","tldr":"It can be challenging to stay motivated when working on your own. Things that can help include finding engaging work, building routines, being intentional with down times, staying active in communities, and writing. Working solo means there isn't anything specific you have to do. No one will notice if you decide not to work - but things will start falling apart if you continue to skip work for too many days.","date":"2023-10-06","category":"miscellaneous","newsletter":"tech"},{"id":235765,"url":"https://www.space.com/spacex-elon-musk-starship-expectations-second-flight?utm_source=tldrnewsletter","title":"SpaceX's Starship has 'decent chance' of success on upcoming flight, Elon Musk says (8 minute read)","tldr":"The FAA has yet to award a license for another Starship test launch - SpaceX also needs to receive environmental approval from the US Fish and Wildlife Service.","date":"2023-10-06","category":"quick","newsletter":"tech"},{"id":235766,"url":"https://www.cnbc.com/2023/10/04/future-of-chatgpt-from-openai-chief-technology-officer.html?utm_source=tldrnewsletter","title":"ChatGPT will ‘help us with extremely hard problems’ in the future, says OpenAI’s chief tech officer (10 minute read)","tldr":"A revolution in the way we work is coming - this could mean that we end up working less and the workweek may change entirely.","date":"2023-10-06","category":"quick","newsletter":"tech"},{"id":235767,"url":"https://dotat.at/@/2023-05-26-whence-time.html?utm_source=tldrnewsletter","title":"Where does my computer get the time from? (7 minute read)","tldr":"An deep dive into the chain of time sources.","date":"2023-10-06","category":"quick","newsletter":"tech"},{"id":235768,"url":"https://techcrunch.com/2023/10/05/google-deepmind-unites-researchers-in-bid-to-create-an-imagenet-of-robot-actions/?utm_source=tldrnewsletter","title":"Google DeepMind unites researchers in bid to create an ImageNet of robot actions (2 minute read)","tldr":"The Open X-Embodiment is a database of more than 14 million images created by Google's DeepMind robotics team with help from 33 research institutes.","date":"2023-10-06","category":"quick","newsletter":"tech"},{"id":235769,"url":"https://timkellogg.me/blog/2023/10/01/interpretability?utm_source=tldrnewsletter","title":"LLMs are Interpretable (9 minute read)","tldr":"Large language models are the most interpretable form of machine learning that has come into broad usage.","date":"2023-10-06","category":"quick","newsletter":"tech"},{"id":235770,"url":"https://www.macrumors.com/2023/10/05/apple-vision-pro-screen-mirroring-tidbits/?utm_source=tldrnewsletter","title":"Apple Vision Pro to Support Screen Mirroring via AirPlay and Other Tidbits (2 minute read)","tldr":"Code found in the beta 4 release of visionOS 1.0 indicates that Apple's Vision Pro headset will support screen mirroring via AirPlay or FaceTime.","date":"2023-10-06","category":"quick","newsletter":"tech"}],"subject":"OpenAI explores AI chips 🤖, Apple discussed ditching Google 🔍, how computers tell time ⏰"},"__N_SSG":true},"page":"/tech/[date]","query":{"date":"2023-10-06"},"buildId":"_Y_XY3olqvPRDZOxYmiOc","isFallback":false,"gsp":true,"scriptLoader":[]}