{"props":{"pageProps":{"date":"2023-10-06","stories":[{"id":235691,"url":"https://engineercodex.substack.com/p/how-google-writes-clean-maintainable?utm_source=tldrwebdev","title":"How Google writes clean, maintainable code (5 minute read)","tldr":"Google has a process called “readability” that allows it to maintain certain coding standards and best practices in its monolithic codebase. It has published its style guides online and has described the readability process in its book “Software Engineering at Google”. Readability helps Google increase knowledge sharing, maintain its codebase's health, enforce best practices, and sustain a culture of mentorship. However, readability results in slower code velocity. The article goes through some examples of clean TypeScript code using Google’s style guide.","date":"2023-10-06","category":"webdevarticles","newsletter":"webdev"},{"id":235712,"url":"https://dev.to/devteam/career-growth-after-35-what-awaits-programmers-1ff0?utm_source=tldrwebdev","title":"Career Growth After 35: What Awaits Programmers? (8 minute read)","tldr":"A Q\u0026amp;A where over-35 software engineers answer how their careers are.","date":"2023-10-06","category":"webdevquick","newsletter":"webdev"},{"id":235692,"url":"https://semaphoreci.com/blog/securing-nodejs?utm_source=tldrwebdev","title":"Best Practices for Securing Node.js Applications in Production (13 minute read)","tldr":"This article provides fifteen best practices for securing Node.js applications in production. These include setting secure HTTP headers, implementing rate limiting, and enforcing strong authentication policies. The article goes through each best practice with short code examples and images.","date":"2023-10-06","category":"webdevarticles","newsletter":"webdev"},{"id":235693,"url":"https://github.blog/2023-10-04-how-to-communicate-like-a-github-engineer-our-principles-practices-and-tools/?utm_source=tldrwebdev","title":"How to communicate like a GitHub engineer: Our principles, practices, and tools (8 minute read)","tldr":"GitHub is a remote-first company, so its communication approach is rooted in asynchronous communication. The team uses GitHub not just for code hosting, but also for planning, discussing, and documenting work. To manage communication effectively, they created the \"How we communicate\" guidance, with rules such as preferring asynchronous communication and embracing collaboration. GitHub also uses AI to reduce notification fatigue and summarize discussion posts, making it easy for people to catch up on conversations they missed quickly.","date":"2023-10-06","category":"webdevopinons","newsletter":"webdev"},{"id":235701,"url":"https://github.com/iamkun/dayjs?utm_source=tldrwebdev","title":"Day.js (GitHub Repo)","tldr":"Day.js is a minimalist JavaScript library that parses, validates, manipulates, and displays dates and times for modern browsers with a largely Moment.js-compatible API. If you use Moment.js, you already know how to use Day.js.","date":"2023-10-06","category":"webdevlaunches","newsletter":"webdev"},{"id":235694,"url":"https://prateeksurana.me/blog/nextjs-13-vs-remix-an-in-depth-case-study/?utm_source=tldrwebdev","title":"Next.js 13 vs Remix: An In-depth case study (33 minute read)","tldr":"This is a detailed comparison between Next.js 13 and Remix Run for building an example Twitter-like app. Next.js 13 and Remix both have adopted similar layout approaches. While Remix uses loaders for data fetching, Next.js 13 introduces React Server Components, offers a superior developer experience. Both support Streaming with Suspense to enhance user experience.","date":"2023-10-06","category":"webdevopinons","newsletter":"webdev"},{"id":235696,"url":"https://github.com/prevwong/craft.js?utm_source=tldrwebdev","title":"Craft.js (GitHub Repo)","tldr":"Craft.js is a React framework for building extensible drag and drop page editors. It modularizes the building blocks of a page editor and ships with a drag-and-drop system.","date":"2023-10-06","category":"webdevlaunches","newsletter":"webdev"},{"id":235699,"url":"https://github.com/af/envalid?utm_source=tldrwebdev","title":"Envalid (GitHub Repo)","tldr":"Envalid is a small library for validating and accessing environment variables in Node.js programs. It provides developers with documentation about a program’s expected environment and ensures that a program only runs when its environmental dependencies are met.","date":"2023-10-06","category":"webdevlaunches","newsletter":"webdev"},{"id":235703,"url":"https://blog.apnic.net/2023/09/25/why-http-3-is-eating-the-world/?utm_source=tldrwebdev","title":"Why HTTP/3 is eating the world (5 minute read)","tldr":"HTTP/3, a new version of the HyperText Transfer Protocol (HTTP), has gained rapid adoption on the internet, with support ranging from 19% to over 50% among web servers and networks. It is used extensively by major companies like Google and Meta. HTTP/3 solves several problems of older protocols like TCP, offering better security, encryption, efficiency, and performance. Its adoption has been driven by its improved performance, which makes it ideal for loading web pages and streaming videos.","date":"2023-10-06","category":"webdev","newsletter":"webdev"},{"id":235705,"url":"https://blog.bytebytego.com/p/no-more-vendor-lock-in-the-rise-of?utm_source=tldrwebdev","title":"No More Vendor Lock-In? The Rise of Sky Computing (20 minute read)","tldr":"Traditional cloud computing often confines users to vendor-specific platforms. Sky Computing reduces this dependency – it’s a technical abstraction layer on top of cloud providers that allow cloud apps to operate freely across multiple cloud providers. This approach offers benefits such as cost optimization, redundancy, risk mitigation, and performance enhancement. It allows companies to achieve greater flexibility, scalability, and avoid vendor lock-in, while cloud providers can tap into new revenue opportunities and expand their market share.","date":"2023-10-06","category":"webdev","newsletter":"webdev"},{"id":235706,"url":"https://dotat.at/@/2023-05-26-whence-time.html?utm_source=tldrwebdev","title":"Where does my computer get the time from? (3 minute read)","tldr":"A short informal blog post that explains where various computers in different locations get the time from.","date":"2023-10-06","category":"webdevquick","newsletter":"webdev"},{"id":235708,"url":"https://link.springer.com/content/pdf/10.1007/978-1-4842-9711-7.pdf?utm_source=tldrwebdev","title":"Database Performance at Scale (Book)","tldr":"Database Performance at Scale is a free book about database performance at scale. It’s written by ScyllaDB engineers who have worked with scaling large systems like Discord and is available as a PDF.","date":"2023-10-06","category":"webdevquick","newsletter":"webdev"},{"id":235710,"url":"https://blog.replit.com/building-my-first-slack-bot?utm_source=tldrwebdev","title":"I’m not a programmer, and I used AI to build my first bot (4 minute read)","tldr":"The author of this article was able to create a Slack bot with Replit and its AI capabilities.","date":"2023-10-06","category":"webdevquick","newsletter":"webdev"}],"subject":"How Google writes clean code 🧑‍💻, GitHub’s remote-first culture 🌎, secure Node apps 🖼️"},"__N_SSG":true},"page":"/webdev/[date]","query":{"date":"2023-10-06"},"buildId":"_Y_XY3olqvPRDZOxYmiOc","isFallback":false,"gsp":true,"scriptLoader":[]}