{"props":{"pageProps":{"date":"2023-08-23","stories":[{"id":229087,"url":"https://www.datadoghq.com/resources/frontend-monitoring-best-practices/?utm_source=advertisement\u0026amp;utm_medium=newsletter\u0026amp;utm_campaign=dg-tldrnewsletter-apm-ww-frontend-monitoring-best-practices","title":"Frontend Monitoring — Best Practices Guide by Datadog (Sponsor)","tldr":"Learn how to monitor three key aspects of your single-page apps to help you optimize your users’ experience.\u003cp\u003e\u003ca href=\"https://www.datadoghq.com/resources/frontend-monitoring-best-practices/?utm_source=advertisement\u0026amp;utm_medium=newsletter\u0026amp;utm_campaign=dg-tldrnewsletter-apm-ww-frontend-monitoring-best-practices\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003eDownload the guide\u003c/a\u003e to learn best practices for measuring:\u003c/p\u003e\u003cp\u003e↩️\u0026nbsp;Route changes, to optimize page transitions\u003c/p\u003e\u003cp\u003e🙋‍♀️\u0026nbsp;User interactions, to ensure a smooth user experience\u003c/p\u003e\u003cp\u003e🤦‍♂️\u0026nbsp;Errors, to catch and debug issues in the browser\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://www.datadoghq.com/resources/frontend-monitoring-best-practices/?utm_source=advertisement\u0026amp;utm_medium=newsletter\u0026amp;utm_campaign=dg-tldrnewsletter-apm-ww-frontend-monitoring-best-practices\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003eGet the free PDF from Datadog 🎁\u003c/a\u003e\u003c/p\u003e","date":"2023-08-23","category":"webdevsponsor","newsletter":"webdev"},{"id":229088,"url":"https://netflixtechblog.com/ava-discovery-view-surfacing-authentic-moments-b8cd145491cc?utm_source=tldrwebdev","title":"AVA Discovery View: Surfacing Authentic Moments (10 minute read)","tldr":"Netflix stores millions of image files and other artwork to represent their titles. Its assets are often created by selecting static image frames directly from our source videos. To make this process easier, Netflix created AVA, an internal tool that surfaces still frames from video content. The tool provides an efficient way for creatives to pull moments from video content that authentically represent the title’s narrative themes, main characters, and visual characteristics.","date":"2023-08-23","category":"webdevarticles","newsletter":"webdev"},{"id":229089,"url":"https://engineering.leanix.net/blog/typescript-generics-advanced-function-types/?utm_source=tldrwebdev","title":"TypeScript’s Generics and Advanced Function Types (12 minute read)","tldr":"This is a guide on how to create flexible and type-safe code environments using Typescript features like generics and advanced function types. Advanced function types help developers write robust and flexible code that adheres to static typing and OOP principles, through features like function overloading and optional, default, and rest parameters. Generics allow developers to create components that engage with various data types while preserving type information, ensuring both type safety and code reusability. The guide provides explanations and code examples of these concepts and also gives some best practices and pitfalls to avoid.","date":"2023-08-23","category":"webdevarticles","newsletter":"webdev"},{"id":229091,"url":"https://davidgomes.com/the-broad-set-of-computer-science-problems-faced-at-cloud-database-companies/?utm_source=tldrwebdev","title":"The Broad Set of Computer Science Problems Faced at Cloud Database Companies (3 minute read)","tldr":"Databases are notoriously hard to build and they have complex problems that are still being worked on today. Cloud-native databases are much more common as data has become more valuable and data sizes get larger. Building a cloud-native database adds another huge layer of complexity to the already hard problem set of databases. For example, it is expected that databases can scale up and down much more flexibly in the cloud, but this is very hard to do in practice.","date":"2023-08-23","category":"webdevopinons","newsletter":"webdev"},{"id":229109,"url":"https://x.com/iximiuz/status/1692917272145219849?utm_source=tldrwebdev","title":"Understanding Kubernetes Through VMs (X Thread)","tldr":"This thread explains Kubernetes through a series of deployment evolutions, starting with VMs, to docked containers, then to Kubernetes pods. It discusses how each evolution of deployment works, challenges, and how they are addressed with the next evolution.","date":"2023-08-23","category":"webdevquick","newsletter":"webdev"},{"id":229092,"url":"https://kjhealey.medium.com/cached-takes-80-of-companies-do-not-need-snowflake-or-databricks-5ebda64c0853?utm_source=tldrwebdev","title":"Cached Takes: 80% of Companies do not need Snowflake or Databricks (5 minute read)","tldr":"80% of companies don’t need Snowflake and Databricks when there are open source, free alternatives. The services that Snowflake and Databricks provide are mainly for large companies that can actually take advantage of all the tools provided. Instead, smaller companies should identify inefficiencies and replace paid software with open source software that mimics the core functionalities until there is a need to upgrade.","date":"2023-08-23","category":"webdevopinons","newsletter":"webdev"},{"id":229094,"url":"https://blog.thinkst.com/2023/08/default-behaviour-sticks-and-so-do-examples.html?utm_source=tldrwebdev","title":"Default behavior sticks - and so do examples (6 minute read)","tldr":"Canarytokens is a security company that helps customers detect intrusions by using Canarytokens: decoys that are placed on a customer's network or systems. It recently realized that some of its customers, due to an example in its documentation, were using the same custom domain for their Canarytokens. This made the Canarytokens more identifiable because attackers could simply look for domains that matched the custom domain. To address this, Canarytokens will now show multiple examples of custom domains to its customers. This will make it more likely that customers will choose a unique custom domain for their Canarytokens, which will make them more difficult for attackers to identify.","date":"2023-08-23","category":"webdevopinons","newsletter":"webdev"},{"id":229096,"url":"https://porkbun.com/land/dot-pro-domain-name-registration?coupon=DOTPROFREE2\u0026amp;utm_source=DevMedia\u0026amp;utm_medium=Newsletter\u0026amp;utm_campaign=DevMedia2023","title":"Get a FREE domain for your personal website or portfolio (Sponsor)","tldr":"Need a place to showcase your digital portfolio? Now you can get a free .pro domain to host proof of your growing web dev skills and experience. \u003ca href=\"https://porkbun.com/land/dot-pro-domain-name-registration?coupon=DOTPROFREE2\u0026amp;utm_source=DevMedia\u0026amp;utm_medium=Newsletter\u0026amp;utm_campaign=DevMedia2023\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003eGet your .pro domain name FREE\u003c/a\u003e for the first year from Porkbun, and show the world what you can do. Includes WHOIS privacy protection, free SSL, and a free trial for web hosting and email. \u003ca href=\"https://porkbun.com/land/dot-pro-domain-name-registration?coupon=DOTPROFREE2\u0026amp;utm_source=DevMedia\u0026amp;utm_medium=Newsletter\u0026amp;utm_campaign=DevMedia2023\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003eClaim your offer here\u003c/a\u003e","date":"2023-08-23","category":"webdevlaunches","newsletter":"webdev"},{"id":229098,"url":"https://visualdb.com/?utm_source=tldrwebdev","title":"Visual DB (Website)","tldr":"Visual DB is an Airtable alternative. It allows developers to effortlessly create forms and sheets to enter data. Visual DB can display up to 100,000 records at a time.","date":"2023-08-23","category":"webdevlaunches","newsletter":"webdev"},{"id":229101,"url":"https://github.com/chrieke/prettymapp?utm_source=tldrwebdev","title":"Prettymapp (GitHub Repo)","tldr":"Prettymapp is a web app and Python package to create beautiful maps from OpenStreetMap data. It provides a simple API to create maps with a focus on implementation speed.","date":"2023-08-23","category":"webdevlaunches","newsletter":"webdev"},{"id":229103,"url":"https://www.newyorker.com/magazine/2023/08/28/elon-musks-shadow-rule?utm_source=tldrwebdev","title":"Elon Musk’s Shadow Rule (22 minute read)","tldr":"Elon Musk, the world’s richest man, has controlling stakes in Tesla, SpaceX, and Starlink. These three companies have moved their respective industries so far forward that governments depend on them. For example, Tesla’s charging infrastructure plays a role in the US government’s push toward clean energy. NASA almost solely uses SpaceX rockets now. Starlink has played a role in the Russia-Ukraine war. This article delves into how Elon Musk is not just a key player in technology anymore, but inadvertently a geopolitical player by himself due to the level of influence he has through his companies. This has been further shown by Musk’s purchase of Twitter, through which he has a social media platform where a lot of online discourse and political information disseminates.","date":"2023-08-23","category":"webdev","newsletter":"webdev"},{"id":229104,"url":"https://open.substack.com/pub/aisupremacy/p/an-overview-of-googles-ai-product?utm_source=tldrwebdev","title":"An Overview of Google’s AI Product Strategy (6 minute read)","tldr":"Google Gemini, a new family of large language models that aims to rival OpenAI's ChatGPT, is rumored to be released soon. In the meantime, Google is integrating AI into many of its products including Search with the Search Generative Experience. On the application layer, Google is working on Duet AI, which is the name for the intelligent assistant that is being deployed throughout a number of enterprise and developer-focused tools, with corresponding capabilities for each set of use cases.","date":"2023-08-23","category":"webdev","newsletter":"webdev"},{"id":229107,"url":"https://dev.to/diwakarkashyap/cookies-vs-local-storage-in-javascript-3m0h?utm_source=tldrwebdev","title":"Cookies vs Local Storage in JavaScript (1 minute read)","tldr":"Both cookies and Local Storage are ways to store client-side data in the browser, but each has different purposes based on your web app’s needs.","date":"2023-08-23","category":"webdevquick","newsletter":"webdev"},{"id":229111,"url":"https://techcrunch.com/2023/08/21/developers-are-now-using-ai-for-text-to-music-apps/amp/?utm_source=tldrwebdev","title":"Developers are now using AI for text-to-music apps (3 minute read)","tldr":"People have used large language models to mold text in different ways, ranging from writing emails to summarizing articles. Developers are now looking to help people generate bits of music by just typing some words.","date":"2023-08-23","category":"webdevquick","newsletter":"webdev"},{"id":229113,"url":"https://www.linkedin.com/news/story/adobe-co-founder-warnock-dies-5413241/?utm_source=tldrwebdev","title":"Adobe co-founder Warnock dies (LinkedIn Post)","tldr":"Adobe co-founder and former CEO John Warnock has died at the age of 82.","date":"2023-08-23","category":"webdevquick","newsletter":"webdev"}],"subject":"Netflix’s image tooling 🛠, cloud database problems 👨‍💻, JS cookies vs local storage 💻"},"__N_SSG":true},"page":"/webdev/[date]","query":{"date":"2023-08-23"},"buildId":"zp5OT1eBQ797DImZrAN9g","isFallback":false,"gsp":true,"scriptLoader":[]}